{
    "extensionName": {
        "message": "Extension IMAGE",
        "description": "Nom de l'extension"
    },
    "extensionNameTest": {
        "message": "Extension IMAGE (Test)",
        "description": "Nom de l'extension de test"
    },
    "extensionDescription": {
        "message": "Extension pour le projet IMAGE McGill. Il s'agit d'une version bêta.",
        "description": "Brève description de l'extension."
    },
    "menuItem": {
        "message": "Interpréter ce graphique avec IMAGE",
        "description": "Récupérer IMAGE rendus audio et haptiques pour une image."
    },
    "renderingOptions": {
        "message": "Options de rendu",
        "description": "En-tête de la fenêtre d'options"
    },
    "noInputURL": {
        "message": "Continuer sans entrer l'URL personnalisé ne donnera aucun rendu.",
        "description": "Message d'erreur si aucune URL n'est fournie."
    },
    "noRenderings": {
        "message": "Aucune interprétation n'apparaîtra si les cases Audio et Texte ne sont pas cochées !",
        "description": "Message d'erreur si aucun rendu n'est renvoyé."
    },
    "perferencesSaved": {
        "message": "Préférences enregistrées !",
        "description": "Message affiché lorsque les paramètres sont enregistrés."
    },
    "preprocessItem": {
        "message": "DEBUG : Obtenir les données prétraitées",
        "description": "Récupérer les données JSON prétraitées d'une image sans rendu."
    },
    "requestItem": {
        "message": "DEBUG : Obtenir les données de la requête",
        "description": "Demande de téléchargement à envoyer au serveur."
    },
    "processingRequest": {
        "message": "Traiter la demande",
        "description": "Titre de la barre de progression"
    },
    "renderingTitle": {
        "message": "Rendus",
        "description": "En-tête de la fenêtre popup"
    },
    "renderingLabel": {
        "message": "Interprétation",
        "description": "Étiquette pour chaque rendu renvoyé par le serveur"
    },
    "segmentAudioSelLabel": {
        "message": "Une partie du rendu pour jouer",
        "description": "Étiquette pour le menu de sélection SegmentAudio."
    },
    "segmentAudioFullRendering": {
        "message": "Rendu complet",
        "description": "Option de sélection pour lire l'ensemble du rendu."
    },
    "downloadAudioFile": {
        "message": "Télécharger le fichier audio",
        "description": "Etiquette pour le bouton de téléchargement du rendu audio."
    },
    "svgLayerSelection": {
        "message": "Veuillez choisir une couche SVG",
        "description": "Étiquette pour le menu de sélection des couches SVG."
    },
    "segmentAudioButton": {
        "message": "Play/Stop",
        "description": "Étiquette permettant de lire et d'arrêter les rendus audio du segment audio sélectionné."
    },
    "audioRenderingsLabel": {
        "message": "Audio (rendus spécialisés, à découvrir avec un casque stéréo)",
        "description": "Rendu audio"
    },
    "textRenderingsLabel": {
        "message": "Texte (pour les lecteurs d'écran)",
        "description": "Rendus textuels"
    },
    "languageSelectionLabel": {
        "message": "Langue",
        "description": "Étiquette pour le menu de sélection de la langue."
    },
    "automaticLanguage": {
        "message": "Automatique",
        "description": "Option de sélection pour la langue automatique."
    },
    "languageWarning": {
        "message": "Avertissement : Dans quelques cas, les résultats d'IMAGE peuvent apparaître en anglais ou en français au lieu de la langue choisie, en raison de limitations techniques.",
        "description": "Avertissement pour la selection de la langue."
    },
    "cancelButton": {
        "message": "Annuler",
        "description": "Bouton d'annulation."
    },
    "saveChangesButton": {
        "message": "Enregistrer",
        "description": "Étiquette pour enregistrer les préférences de l'utilisateur."
    },
    "monoSoundLabel": {
        "message": "Mono Audio",
        "description": "Étiquette pour l'option audio mono dans les préférences de l'extension."
    },
    "advancedOptions": {
        "message": "Options avancées",
        "description": "Étiquette pour les options avancées dans les préférences de l'extension."
    },
    "serverOptions": {
        "message": "Serveur",
        "description": "Étiquette pour les options de serveur dans les préférences de l'extension."
    },
    "mcgillServerLabel": {
        "message": "Serveur McGill",
        "description": "Étiquette pour serveur McGill."
    },
    "customServerLabel": {
        "message": "Personnalisé (entrer l'URL du serveur)",
        "description": "Étiquette pour serveur personnalisé."
    },
    "noHaptics": {
        "message": "Aucune",
        "description": "Étiquette pour pas d'option haptiques."
    },
    "Haply2diy2gen": {
        "message": "Haply 2diy-2gen",
        "description": "Étiquette pour l'option Haply 2diy-2Gen."
    },
    "Haply2diy3gen": {
        "message": "Haply 2diy-3gen",
        "description": "Étiquette pour l'option Haply 2diy-3Gen."
    },
    "Haply2diyNotSupported": {
        "message": "Haply 2diy: Indisponible car ce navigateur ne supporte pas le Web Serial.",
        "description": "Étiquette pour l'option Haply 2diy lorsqu'elle n'est pas supportée par le navigateur"
    },
    "preprocessMap": {
        "message": "Obtenir des données cartographiques prétraitées",
        "description": "Récupérer des données JSON prétraitées pour une carte sans rendu."
    },
    "saveDataSuccess": {
        "message": "Vos données ont été sauvegardées avec succès."
    },
    "saveDataInvalid": {
        "message": "Le message envoyé par l'extension n'était pas valide. Cela ne devrait pas se produire."
    },
    "savedataUnauthorized": {
        "message": "Le message envoyé par l'extension n'a pas été authentifié pour cette réponse. Si cela fait plus d'une heure, vos données ont déjà été supprimées."
    },
    "saveDataServerError": {
        "message": "Une erreur s'est produite lors du traitement de cette demande. Cela ne devrait pas se produire."
    },
    "saveDataNotImplemented": {
        "message": "Vos données n'ont pas pu être sauvegardées car le serveur utilisé ne prend pas en charge cette fonctionnalité."
    },
    "explainRendering":{
        "message": "Expliquez-moi ce rendu.",
        "description": "Lien avec l'explication des rendus"
    },
    "getMapRendering": {
        "message": "Interpréter cette carte avec IMAGE",
        "description": "Étiquette pour le bouton permettant d'obtenir les rendus de la carte"
    },
    "getMapPreprocessorResponse": {
        "message": "Obtenir les données prétraitées IMAGE",
        "description": "Étiquette pour bouton pour obtenir Map Preprocessor Response"
    },
    "getChartRendering": {
        "message": "Interpréter ce graphique avec IMAGE",
        "description": "Étiquette pour le bouton permettant d'obtenir les rendus du graphique"
    },
    "tutorialLaunchPad": {
        "message": "Aide ! Comment utiliser IMAGE ?",
        "description": "Étiquette pour le bouton de lancement du didacticiel IMAGE"
    },
    "localFileLaunchPad": {
        "message": "Utiliser IMAGE sur un graphique de mon ordinateur",
        "description": "Etiquette pour le bouton de chargement du fichier local"
    },
    "optionsLaunchPad": {
        "message": "Options d'IMAGE",
        "description": "Étiquette pour le bouton permettant de lancer les options d'IMAGE"
    },
    "popUpTitle": {
        "message": "Extension IMAGE",
        "description": "En-tête de la fenêtre popup"
    },
    "getRenderingLocalFile": {
        "message": "Obtenir le rendu de l'IMAGE",
        "description": "Étiquette pour le bouton permettant d'obtenir des rendus d'un fichier local"
    },
    "debugText":{
        "message": "L'activation du mode développeur permet d'accéder aux options de débogage à partir du menu contextuel du navigateur.",
        "description": "Description du mode de débogage."
    },
    "developerMode": {
        "message": "Mode développeur",
        "description": "Étiquette pour le mode développeur"
    },
    "errorMessage": {
        "message": "Une erreur s'est produite lors de la connexion au serveur IMAGE. Veuillez réessayer plus tard. Si cette erreur persiste, veuillez contacter l'équipe IMAGE par courriel à ",
        "description": "Message d'erreur lorsque le serveur est inaccessible."
    },
    "closingButton": {
        "message": "Fermer",
        "description": "Bouton pour fermer la fenêtre d'erreur."
    },
    "unableToRender": {
        "message": "IMAGE ne peut pas rendre ce graphique.",
        "description": "Message d'incapatibilité de rendu."
    },
    "feedbackFormLinkBefore": {
        "message": "Si vous souhaitez nous en faire part, veuillez utiliser ",
        "description": "Message du formulaire d'évaluation, avant le lien."
    },
    "feedbackFormLink": {
        "message": "notre formulaire d'évaluation",
        "description": "Le lien du formulaire d'évaluation."
    },
    "feedbackFormLinkAfter" : { 
        "message": "Si vous ne pouvez pas utiliser le formulaire, vous pouvez également envoyer un lien vers ce graphique et une brève description du problème par courrier électronique:",
        "description": "Message du formulaire d'évaluation, après le lien."
    },
    "feedbackFormCaution": {
        "message": "Dans les deux cas, veillez à ce que le graphique que vous envoyez ne contienne aucune information personnelle.",
        "description": "Message du formulaire d'évaluation, mise en garde sur les informations personnelles."
    },
    "commonIssues": {
        "message": "Certains problèmes courants empêchent IMAGE de générer un rendu.",
        "description": "Problèmes courants"
    },
    "commonIssuePhotograph": {
        "message": "Graphiques/photographies: Les scènes ne contenant que des objets inhabituels ou bizarrement encadrés, des collages d'images séparées, des graphiques très stylisés ou dessinés à la main et des diagrammes ne sont pas encore bien pris en charge par les outils d'apprentissage automatique et risquent de ne pas produire de rendus utilisables.",
        "description": "Problèmes courants avec graphiques et photographies"
    },
    "commonIssuesHighCharts": {
        "message": "Diagrammes : Nous ne prenons en charge qu'un sous-ensemble de graphiques mis en forme avec le format HighCharts. Actuellement, cela signifie qu'il ne peut s'agir que de graphiques circulaires, de graphiques à tendance unique ou de graphiques à ligne unique. D'autres formats sont en cours de développement.",
        "description": "Problèmes courants avec  HighCharts"
    },
    "commonIssueMaps": {
        "message": "Cartes : Seules les cartes pour lesquelles nous pouvons déterminer la latitude et la longitude du centre de la carte peuvent générer des rendus. Si cet emplacement ne comporte aucun point d'intérêt ni aucune rue à proximité, IMAGE ne peut générer aucun rendu utilisable. Aujourd'hui, seules les cartes Google Maps intégrées dans une page sont prises en charge, mais d'autres formats, tels que Open Street Maps, pourraient l'être à l'avenir.",
        "description": "Problèmes courants avec les cartes"
    },
    "feedbackMessage": {
        "message": "Normalement, nous ne conservons ni ne consultons des informations telles que le graphique, l'URL ou vos paramètres. Cependant, le fait de nous fournir ces informations peut nous aider à améliorer la qualité de votre expérience à l'avenir. Si vous êtes d'accord, nous enregistrerons les informations que vous nous envoyez et les membres de l'équipe du projet IMAGE consulteront les informations de cette seule demande. En tout état de cause, les graphiques fournis ne seront utilisés que pour améliorer votre expérience et ne seront pas mis à la disposition de tiers en dehors de l'équipe du projet IMAGE. Si vous ne souhaitez pas que nous ayons accès à ces informations, la demande sera supprimée normalement de notre serveur et vous pourrez toujours remplir le formulaire de retour d'information.",
        "description": "Message pour le formulaire d'évaluation"
    },
    "feedbackNoPersonalInfo": {
        "message": "Veillez à ce qu'aucune information personnelle ne figure dans le graphique ou dans vos commentaires.",
        "description": "Mise en garde sur les informations personnelles pour le formulaire d'évaluation"
    },
    "feedbackConsent" : {
        "message": "(Optionnel) Je consens à ce que le projet IMAGE enregistre cette demande et les réponses qui y sont associées dans les conditions décrites ci-dessus.",
        "description": "Consentement à l'enregistrement de la demande"
    },
    "feedbackSubmit": {
        "message": "Ouvert le formulaire d'évaluation",
        "description": "Bouton pour ouvrir le formulaire d'évaluation"
    },
    "firstLaunchMessage": {
        "message": "Vous venez d'installer IMAGE! Pour obtenir des instructions sur l'utilisation d'IMAGE, rendez-vous sur le site:",
        "description": "Message de premier lancement"
    },
    "infoFooterFeedback" : {
        "message" : "Comment avez-vous trouvé ces interprétations ? Nous aimons recevoir des commentaires et des rapports de bogues en utilisant ",
        "description" : "Message d'évaluation en bas de page, avant le lien d'évaluation"
    },
    "infoFooterAnythingElse" : {
        "message": "Pour toute autre question, vous pouvez nous écrire à ",
        "description": "Message d'évaluation en bas de page, avant l'adresse e-mail de IMAGE"
    }
}
